{
  "title": "Software Technology Experience",
  "brief": "The software world have a wide variety of problem, one must be familiar with multiple tools to select the right tool for the job.",
  "languages": {
    "title": "Programming Languages",
    "cards": [
      {
        "title": "Java",
        "description": "My main programming languages for developing desktop applications and backend systems. Used to developed application such as Quoridor, GroupUp, and Pet Adoption App.",
        "attribution": { "path": "languages/java.svg" }
      },
      {
        "title": "Typescript",
        "description": "Used to develop all web related projects. Example such as this website, sudoku solver web, and web multiplayer maze.",
        "attribution": { "path": "languages/typescript.svg" }
      },
      {
        "title": "C++",
        "description": "Primarily used in competitive programing due to the performance benefit it offered over other heavy runtime programing languages.",
        "attribution": { "path": "languages/cplusplus.svg" }
      },
      {
        "title": "Python",
        "description": "Mainly for AI/ML project, Django applications and some automation. Some usage includes TSP visualizer, CTF laptop lending system, and Knowledge-Base-Backend.",
        "attribution": { "path": "languages/python.svg" }
      },
      {
        "title": "C#",
        "description": "Used during the internship to develop Windows desktop applications to validate networking hardware and perform security verification in the device ROM.",
        "attribution": { "path": "languages/csharp.svg" }
      },
      {
        "title": "Rust",
        "description": "Recently learned programming language. It offers some safety memory guarantee while being extremely performent. More project coming soon.",
        "attribution": { "path": "languages/rust.svg" }
      }
    ],
    "extraCards": [
      {
        "title": "Ocaml",
        "description": "A language that introduced me to the functional programming paradigm. Mainly used in the course COMP-302 Programming Languages and Paradigms.",
        "attribution": { "path": "languages/ocaml.svg" }
      }
    ]
  },
  "web": {
    "title": "Frontend Technologies",
    "cards": [
      {
        "title": "React",
        "description": "My favorite web development framework. Its component-based system makes creating stateful web application rapidly.",
        "attribution": { "path": "web/react.svg" }
      },
      {
        "title": "Next.JS",
        "description": "The framework used to create this site. It offers the ability to create server-side rendering react application or exported as a static site",
        "attribution": { "path": "web/next.svg" }
      },
      {
        "title": "Tailwind CSS",
        "description": "A utility first CSS framework that help build responsive layout with minimal effort. Also used in this website.",
        "attribution": { "path": "web/tailwind.svg" }
      },
      {
        "title": "HTML",
        "description": "The most basic building block of the web. I am familiar with majority of the syntax and practices.",
        "attribution": { "path": "web/html.svg" }
      },
      {
        "title": "CSS",
        "description": "The fundamental of styling html component and create responsive layout. I am familiar with majority of the CSS syntax and concepts.",
        "attribution": { "path": "web/css.svg" }
      }
    ]
  },
  "backend": {
    "title": "Backend Technologies",
    "cards": [
      {
        "title": "Spring",
        "description": "A Java framework that offer extension to perform data access and web integration. Used for creating GroupUp and Pet Adoption APP.",
        "attribution": { "path": "backend/spring.svg" }
      },
      {
        "title": "Django",
        "description": "A web framework that uses model template view design pattern. It allow user to develop secure web application rapidly. Used for Laptop Lending System and Knowledge Base Backend.",
        "attribution": { "path": "backend/django.svg" }
      },
      {
        "title": "PostgreSQL",
        "description": "An open source SQL relational database management system. Used in all my backend projects.",
        "attribution": { "path": "backend/postgresql.svg" }
      }
    ]
  },
  "test": {
    "title": "Testing Tools",
    "cards": [
      {
        "title": "JUnit 5",
        "description": "A Java testing framework that is commonly used to test Java applications. Used in GroupUp, Quoridor, and Pet Finder.",
        "attribution": { "path": "test/junit.png" }
      },
      {
        "title": "Mocha",
        "description": "A JavaScript/TypeScript test runner that is commonly used. Used in Sudoku Solver Web and this website.",
        "attribution": { "path": "test/mocha.svg" }
      },
      {
        "title": "Chai",
        "description": "A JavaScript/TypeScript assertion library that provides TDD style syntax and many useful apis. Used in Sudoku Solver Web and this website.",
        "attribution": { "path": "test/chai.svg" }
      },
      {
        "title": "Pytest",
        "description": "A python testing framework mainly used to write test for APIs. Used in Knowledge Base Backend",
        "attribution": { "path": "test/pytest.svg" }
      },
      {
        "title": "Cucumber",
        "description": "A software tool that support behavior driven development (BBD). Used in Quoridor and GroupUp",
        "attribution": { "path": "test/cucumber.svg" }
      }
    ]
  },
  "other": {
    "title": "Other Tools",
    "cards": [
      {
        "title": "Git",
        "description": "The most popular version control system for software development.",
        "attribution": { "path": "tools/git.svg" }
      },
      {
        "title": "NPM",
        "description": "Node package manager for installing, updating, and publishing Javascript packages for a project.",
        "attribution": { "path": "tools/npm.svg" }
      },
      {
        "title": "Figma",
        "description": "UX design tool for creating UI designs. Used to create some icons and visual for this website.",
        "attribution": { "path": "tools/figma.svg" }
      }
    ]
  }
}
